Revit 2027 API
IExternalEventHandler.Execute Method
 This method is called to handle the external event.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Execute(
	UIApplication app
)
Sub Execute (
	app As UIApplication
)
void Execute(
	UIApplication^ app
)
abstract Execute :
        app : UIApplication -> unit
Parameters
app UIApplication
See Also
Reference
IExternalEventHandler Interface
Autodesk.Revit.UI Namespace